export const data_ru = {
  design: [
    {
      title: 'Adobe Suite',
      icons: ['i-ps.svg', 'i-ai.svg', 'i-ae.svg', 'i-xd.svg'],
      list: [
        'Работа с растровыми изображениями, ретушь',
        'Векторная графика, отрисовка иконок и т.д.',
        'SVG-анимация, lottie-files, bodymovin...'
      ]
    },
    {
      title: 'Figma',
      icons: ['i-figma.svg'],
      list: [
        'С Figma на Ты',
        'Создание макетов, auto-layouts, компоненты, разработка UI-китов и т.д.',
      ]
    },
    {
      title: 'Вёрстка',
      icons: ['i-html.svg', 'i-css.svg', 'i-scss.svg',],
      list: [
        'Занимаюсь вёрсткой почти 10 лет',
        'Адаптивная вёрстка, mobile-first, семантика',
        'препроцессоры типа SASS и использование CSS-переменных',
      ]
    },
  ],
  frontend: [
    {
      title: 'Языки',
      icons: ['i-js.svg', 'i-ts.svg'],
      list: [
        'Javascript - база, методы массивов, использование нативного JS без React',
        'TypeScript - интерфейсы, типы, enu-ы, типизация всего что только можно (в процессе обучения и понимания)',
        'Codewars - 6 kyu (особо не практикуюс, залез и сижу там на 6-м кю)'
      ]
    },
    {
      title: 'Фреймворки / Библиотеки',
      icons: ['i-react.svg', 'i-react-router.svg', 'i-redux.svg'],
      list: [
        'Начал изучать React через 2 недели после начала изучения JS',
        'Компонены, роутинг, стейт-менеджер Redux и Redux-toolkit...',
      ]
    },
    {
      title: 'Тесты / Контроль',
      icons: ['i-jest.svg', 'i-storybook.svg', 'i-loki.svg'],
      list: [
        'Написание unit-тестов (в процессе изучения)',
        'Ведение storybook для визцального контроля компонентов. Декораторы',
        'Немного работал с Loki для скриншотного контроля'
      ]
    },
    {
      title: 'Сборщик модулей',
      icons: ['i-webpack.svg'],
      list: [
        'Сборка webpack для React приложения с нуля',
        'Настройка и понимание базовых плагинов, линтов, Babel и т.д.',
      ]
    },
    {
      title: 'Дистрибуторы',
      icons: ['i-git.svg', 'i-github.svg', 'i-git-actions.svg'],
      list: [
        'Работа с Git, сильно не углублялся, но база есть',
        'Работа с git-actions, CI-pipline, для автоматизации разных видов проверок'
      ]
    },
    {
      title: 'Линтеры',
      icons: ['i-eslint.svg', 'i-stylelint.svg'],
      list: [
        'Настройка линтеров с нуля и коррекция их поведения под себя'
      ]
    },
    {
      title: 'Перевод',
      icons: ['i-i18n.svg'],
      list: [
        'Работа с i18next, собственно данная технология применена в моем прокте сайта-портфоило'
      ]
    },
    {
      title: 'Архитектура',
      icons: ['i-fsd.svg'],
      list: [
        'FSD-архитектура при разработе крупного проекта',
        'Основное понимание концепции'
      ]
    },
  ],
}