{
  "About": "Обо",
  "me": "мне",
  "Chronology": "Хронология",
  "Main info": "Основная информация",
  "history_2010": "В 2010 году закончил Санкт-Петербургский государственный университет промышленных технологий и дизайна (СПБГУПТД) по специальности “Графический Дизайнер”",
  "history_2012": "В 2012 году решил переквалифицироваться в web-дизайнера, почти сразу же изучил вёрстку HTML/CSS. Устроился на свою первую работу как web-дизайнер. После 3 года занимался фрилансом на freelance.ru",
  "history_2015": "Летом 2015 устроился в известную IT-компанию SEMrush в отдел платного траффика (PPC). В мои основные задачи входило создание дизайн-макетов для лендингов, их вёрстка, подключение форм регистрации и обслуживание данных лендингов на сервере. В компании я проработал ровно 4 года",
  "history_2019": "С конца 2019 по лето 2022 работал в эстонской компании Crezu на аутсорсе так же в должности web-дизайнера",
  "history_2022": "В августе 2022 устроился в Quadcode где проработал три месяца",
  "November": "Ноябрь",
  "history_2022nov": "В конце ноября 2022 решил сменить род деятельности и стал усиленно изучать frontend-технологии. Прошел 2 курса по базовом и продвинутому Javascript",
  "January": "Январь",
  "history_2023jan": "Начал изучать React, как основной фреймворк",
  "February": "Февраль",
  "history_2023feb": "Стартовал 4-х месячный курс по продувинутому React/Typescript...",
  "March": "Март",
  "history_2023mar": "Разработка своего сайта-портфолио",
  "Web-design": "Web-дизайн",
  "Frontend Development": "Frontend-разработка",

  "main_information": "Общая информация",
  "main_1": "Лабзов Константин, родился в 1987 году в Санкт-Петербурге.",
  "main_2": "Работал в 2х крупных  питерских IT-компаниях на должности web-дизайнера. В конце 2022 года решил расширить род деятельности и изучить frontend-технологии, так как заниматься чистым дизайном стало довольно скучно.",
  "main_3": "Люблю делать красиво и изучать новые технологии, быстро обучаюсь.",
  "main_4": "Хотел бы участвовать в разработке крупного проекта в команде, где пригодились бы все мои навыки.",
  "main_5": "Так же в планах изучить React Native для разработки мобильных приложений. Сейчас работаю над парой интересных концепций.",
  "main_6": "В свободное время люблю кататься на скейте и писать музыку."
}
